jdotw/OpInst-Bass-1/Firmware-PIC18F26Q10.X/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.7
        Device            :  PIC18F26Q10
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.31 and above
        MPLAB 	          :  MPLAB X 5.45	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set RA0 procedures
#define RA0_SetHigh()            do { LATAbits.LATA0 = 1; } while(0)
#define RA0_SetLow()             do { LATAbits.LATA0 = 0; } while(0)
#define RA0_Toggle()             do { LATAbits.LATA0 = ~LATAbits.LATA0; } while(0)
#define RA0_GetValue()              PORTAbits.RA0
#define RA0_SetDigitalInput()    do { TRISAbits.TRISA0 = 1; } while(0)
#define RA0_SetDigitalOutput()   do { TRISAbits.TRISA0 = 0; } while(0)
#define RA0_SetPullup()             do { WPUAbits.WPUA0 = 1; } while(0)
#define RA0_ResetPullup()           do { WPUAbits.WPUA0 = 0; } while(0)
#define RA0_SetAnalogMode()         do { ANSELAbits.ANSELA0 = 1; } while(0)
#define RA0_SetDigitalMode()        do { ANSELAbits.ANSELA0 = 0; } while(0)

// get/set RA1 procedures
#define RA1_SetHigh()            do { LATAbits.LATA1 = 1; } while(0)
#define RA1_SetLow()             do { LATAbits.LATA1 = 0; } while(0)
#define RA1_Toggle()             do { LATAbits.LATA1 = ~LATAbits.LATA1; } while(0)
#define RA1_GetValue()              PORTAbits.RA1
#define RA1_SetDigitalInput()    do { TRISAbits.TRISA1 = 1; } while(0)
#define RA1_SetDigitalOutput()   do { TRISAbits.TRISA1 = 0; } while(0)
#define RA1_SetPullup()             do { WPUAbits.WPUA1 = 1; } while(0)
#define RA1_ResetPullup()           do { WPUAbits.WPUA1 = 0; } while(0)
#define RA1_SetAnalogMode()         do { ANSELAbits.ANSELA1 = 1; } while(0)
#define RA1_SetDigitalMode()        do { ANSELAbits.ANSELA1 = 0; } while(0)

// get/set RA2 procedures
#define RA2_SetHigh()            do { LATAbits.LATA2 = 1; } while(0)
#define RA2_SetLow()             do { LATAbits.LATA2 = 0; } while(0)
#define RA2_Toggle()             do { LATAbits.LATA2 = ~LATAbits.LATA2; } while(0)
#define RA2_GetValue()              PORTAbits.RA2
#define RA2_SetDigitalInput()    do { TRISAbits.TRISA2 = 1; } while(0)
#define RA2_SetDigitalOutput()   do { TRISAbits.TRISA2 = 0; } while(0)
#define RA2_SetPullup()             do { WPUAbits.WPUA2 = 1; } while(0)
#define RA2_ResetPullup()           do { WPUAbits.WPUA2 = 0; } while(0)
#define RA2_SetAnalogMode()         do { ANSELAbits.ANSELA2 = 1; } while(0)
#define RA2_SetDigitalMode()        do { ANSELAbits.ANSELA2 = 0; } while(0)

// get/set RA3 procedures
#define RA3_SetHigh()            do { LATAbits.LATA3 = 1; } while(0)
#define RA3_SetLow()             do { LATAbits.LATA3 = 0; } while(0)
#define RA3_Toggle()             do { LATAbits.LATA3 = ~LATAbits.LATA3; } while(0)
#define RA3_GetValue()              PORTAbits.RA3
#define RA3_SetDigitalInput()    do { TRISAbits.TRISA3 = 1; } while(0)
#define RA3_SetDigitalOutput()   do { TRISAbits.TRISA3 = 0; } while(0)
#define RA3_SetPullup()             do { WPUAbits.WPUA3 = 1; } while(0)
#define RA3_ResetPullup()           do { WPUAbits.WPUA3 = 0; } while(0)
#define RA3_SetAnalogMode()         do { ANSELAbits.ANSELA3 = 1; } while(0)
#define RA3_SetDigitalMode()        do { ANSELAbits.ANSELA3 = 0; } while(0)

// get/set ADDR1 aliases
#define ADDR1_TRIS                 TRISAbits.TRISA4
#define ADDR1_LAT                  LATAbits.LATA4
#define ADDR1_PORT                 PORTAbits.RA4
#define ADDR1_WPU                  WPUAbits.WPUA4
#define ADDR1_OD                   ODCONAbits.ODCA4
#define ADDR1_ANS                  ANSELAbits.ANSELA4
#define ADDR1_SetHigh()            do { LATAbits.LATA4 = 1; } while(0)
#define ADDR1_SetLow()             do { LATAbits.LATA4 = 0; } while(0)
#define ADDR1_Toggle()             do { LATAbits.LATA4 = ~LATAbits.LATA4; } while(0)
#define ADDR1_GetValue()           PORTAbits.RA4
#define ADDR1_SetDigitalInput()    do { TRISAbits.TRISA4 = 1; } while(0)
#define ADDR1_SetDigitalOutput()   do { TRISAbits.TRISA4 = 0; } while(0)
#define ADDR1_SetPullup()          do { WPUAbits.WPUA4 = 1; } while(0)
#define ADDR1_ResetPullup()        do { WPUAbits.WPUA4 = 0; } while(0)
#define ADDR1_SetPushPull()        do { ODCONAbits.ODCA4 = 0; } while(0)
#define ADDR1_SetOpenDrain()       do { ODCONAbits.ODCA4 = 1; } while(0)
#define ADDR1_SetAnalogMode()      do { ANSELAbits.ANSELA4 = 1; } while(0)
#define ADDR1_SetDigitalMode()     do { ANSELAbits.ANSELA4 = 0; } while(0)

// get/set ADDR2 aliases
#define ADDR2_TRIS                 TRISAbits.TRISA5
#define ADDR2_LAT                  LATAbits.LATA5
#define ADDR2_PORT                 PORTAbits.RA5
#define ADDR2_WPU                  WPUAbits.WPUA5
#define ADDR2_OD                   ODCONAbits.ODCA5
#define ADDR2_ANS                  ANSELAbits.ANSELA5
#define ADDR2_SetHigh()            do { LATAbits.LATA5 = 1; } while(0)
#define ADDR2_SetLow()             do { LATAbits.LATA5 = 0; } while(0)
#define ADDR2_Toggle()             do { LATAbits.LATA5 = ~LATAbits.LATA5; } while(0)
#define ADDR2_GetValue()           PORTAbits.RA5
#define ADDR2_SetDigitalInput()    do { TRISAbits.TRISA5 = 1; } while(0)
#define ADDR2_SetDigitalOutput()   do { TRISAbits.TRISA5 = 0; } while(0)
#define ADDR2_SetPullup()          do { WPUAbits.WPUA5 = 1; } while(0)
#define ADDR2_ResetPullup()        do { WPUAbits.WPUA5 = 0; } while(0)
#define ADDR2_SetPushPull()        do { ODCONAbits.ODCA5 = 0; } while(0)
#define ADDR2_SetOpenDrain()       do { ODCONAbits.ODCA5 = 1; } while(0)
#define ADDR2_SetAnalogMode()      do { ANSELAbits.ANSELA5 = 1; } while(0)
#define ADDR2_SetDigitalMode()     do { ANSELAbits.ANSELA5 = 0; } while(0)

// get/set ADDR3 aliases
#define ADDR3_TRIS                 TRISAbits.TRISA6
#define ADDR3_LAT                  LATAbits.LATA6
#define ADDR3_PORT                 PORTAbits.RA6
#define ADDR3_WPU                  WPUAbits.WPUA6
#define ADDR3_OD                   ODCONAbits.ODCA6
#define ADDR3_ANS                  ANSELAbits.ANSELA6
#define ADDR3_SetHigh()            do { LATAbits.LATA6 = 1; } while(0)
#define ADDR3_SetLow()             do { LATAbits.LATA6 = 0; } while(0)
#define ADDR3_Toggle()             do { LATAbits.LATA6 = ~LATAbits.LATA6; } while(0)
#define ADDR3_GetValue()           PORTAbits.RA6
#define ADDR3_SetDigitalInput()    do { TRISAbits.TRISA6 = 1; } while(0)
#define ADDR3_SetDigitalOutput()   do { TRISAbits.TRISA6 = 0; } while(0)
#define ADDR3_SetPullup()          do { WPUAbits.WPUA6 = 1; } while(0)
#define ADDR3_ResetPullup()        do { WPUAbits.WPUA6 = 0; } while(0)
#define ADDR3_SetPushPull()        do { ODCONAbits.ODCA6 = 0; } while(0)
#define ADDR3_SetOpenDrain()       do { ODCONAbits.ODCA6 = 1; } while(0)
#define ADDR3_SetAnalogMode()      do { ANSELAbits.ANSELA6 = 1; } while(0)
#define ADDR3_SetDigitalMode()     do { ANSELAbits.ANSELA6 = 0; } while(0)

// get/set SW1 aliases
#define SW1_TRIS                 TRISAbits.TRISA7
#define SW1_LAT                  LATAbits.LATA7
#define SW1_PORT                 PORTAbits.RA7
#define SW1_WPU                  WPUAbits.WPUA7
#define SW1_OD                   ODCONAbits.ODCA7
#define SW1_ANS                  ANSELAbits.ANSELA7
#define SW1_SetHigh()            do { LATAbits.LATA7 = 1; } while(0)
#define SW1_SetLow()             do { LATAbits.LATA7 = 0; } while(0)
#define SW1_Toggle()             do { LATAbits.LATA7 = ~LATAbits.LATA7; } while(0)
#define SW1_GetValue()           PORTAbits.RA7
#define SW1_SetDigitalInput()    do { TRISAbits.TRISA7 = 1; } while(0)
#define SW1_SetDigitalOutput()   do { TRISAbits.TRISA7 = 0; } while(0)
#define SW1_SetPullup()          do { WPUAbits.WPUA7 = 1; } while(0)
#define SW1_ResetPullup()        do { WPUAbits.WPUA7 = 0; } while(0)
#define SW1_SetPushPull()        do { ODCONAbits.ODCA7 = 0; } while(0)
#define SW1_SetOpenDrain()       do { ODCONAbits.ODCA7 = 1; } while(0)
#define SW1_SetAnalogMode()      do { ANSELAbits.ANSELA7 = 1; } while(0)
#define SW1_SetDigitalMode()     do { ANSELAbits.ANSELA7 = 0; } while(0)

// get/set RB0 procedures
#define RB0_SetHigh()            do { LATBbits.LATB0 = 1; } while(0)
#define RB0_SetLow()             do { LATBbits.LATB0 = 0; } while(0)
#define RB0_Toggle()             do { LATBbits.LATB0 = ~LATBbits.LATB0; } while(0)
#define RB0_GetValue()              PORTBbits.RB0
#define RB0_SetDigitalInput()    do { TRISBbits.TRISB0 = 1; } while(0)
#define RB0_SetDigitalOutput()   do { TRISBbits.TRISB0 = 0; } while(0)
#define RB0_SetPullup()             do { WPUBbits.WPUB0 = 1; } while(0)
#define RB0_ResetPullup()           do { WPUBbits.WPUB0 = 0; } while(0)
#define RB0_SetAnalogMode()         do { ANSELBbits.ANSELB0 = 1; } while(0)
#define RB0_SetDigitalMode()        do { ANSELBbits.ANSELB0 = 0; } while(0)

