jdotw/OpInst-Bass-1/Firmware-PIC18F26Q10.X/mcc_generated_files/pin_manager.h
// get/set RB1 procedures
#define RB1_SetHigh()            do { LATBbits.LATB1 = 1; } while(0)
#define RB1_SetLow()             do { LATBbits.LATB1 = 0; } while(0)
#define RB1_Toggle()             do { LATBbits.LATB1 = ~LATBbits.LATB1; } while(0)
#define RB1_GetValue()              PORTBbits.RB1
#define RB1_SetDigitalInput()    do { TRISBbits.TRISB1 = 1; } while(0)
#define RB1_SetDigitalOutput()   do { TRISBbits.TRISB1 = 0; } while(0)
#define RB1_SetPullup()             do { WPUBbits.WPUB1 = 1; } while(0)
#define RB1_ResetPullup()           do { WPUBbits.WPUB1 = 0; } while(0)
#define RB1_SetAnalogMode()         do { ANSELBbits.ANSELB1 = 1; } while(0)
#define RB1_SetDigitalMode()        do { ANSELBbits.ANSELB1 = 0; } while(0)

// get/set LED5 aliases
#define LED5_TRIS                 TRISBbits.TRISB2
#define LED5_LAT                  LATBbits.LATB2
#define LED5_PORT                 PORTBbits.RB2
#define LED5_WPU                  WPUBbits.WPUB2
#define LED5_OD                   ODCONBbits.ODCB2
#define LED5_ANS                  ANSELBbits.ANSELB2
#define LED5_SetHigh()            do { LATBbits.LATB2 = 1; } while(0)
#define LED5_SetLow()             do { LATBbits.LATB2 = 0; } while(0)
#define LED5_Toggle()             do { LATBbits.LATB2 = ~LATBbits.LATB2; } while(0)
#define LED5_GetValue()           PORTBbits.RB2
#define LED5_SetDigitalInput()    do { TRISBbits.TRISB2 = 1; } while(0)
#define LED5_SetDigitalOutput()   do { TRISBbits.TRISB2 = 0; } while(0)
#define LED5_SetPullup()          do { WPUBbits.WPUB2 = 1; } while(0)
#define LED5_ResetPullup()        do { WPUBbits.WPUB2 = 0; } while(0)
#define LED5_SetPushPull()        do { ODCONBbits.ODCB2 = 0; } while(0)
#define LED5_SetOpenDrain()       do { ODCONBbits.ODCB2 = 1; } while(0)
#define LED5_SetAnalogMode()      do { ANSELBbits.ANSELB2 = 1; } while(0)
#define LED5_SetDigitalMode()     do { ANSELBbits.ANSELB2 = 0; } while(0)

// get/set LED6 aliases
#define LED6_TRIS                 TRISBbits.TRISB3
#define LED6_LAT                  LATBbits.LATB3
#define LED6_PORT                 PORTBbits.RB3
#define LED6_WPU                  WPUBbits.WPUB3
#define LED6_OD                   ODCONBbits.ODCB3
#define LED6_ANS                  ANSELBbits.ANSELB3
#define LED6_SetHigh()            do { LATBbits.LATB3 = 1; } while(0)
#define LED6_SetLow()             do { LATBbits.LATB3 = 0; } while(0)
#define LED6_Toggle()             do { LATBbits.LATB3 = ~LATBbits.LATB3; } while(0)
#define LED6_GetValue()           PORTBbits.RB3
#define LED6_SetDigitalInput()    do { TRISBbits.TRISB3 = 1; } while(0)
#define LED6_SetDigitalOutput()   do { TRISBbits.TRISB3 = 0; } while(0)
#define LED6_SetPullup()          do { WPUBbits.WPUB3 = 1; } while(0)
#define LED6_ResetPullup()        do { WPUBbits.WPUB3 = 0; } while(0)
#define LED6_SetPushPull()        do { ODCONBbits.ODCB3 = 0; } while(0)
#define LED6_SetOpenDrain()       do { ODCONBbits.ODCB3 = 1; } while(0)
#define LED6_SetAnalogMode()      do { ANSELBbits.ANSELB3 = 1; } while(0)
#define LED6_SetDigitalMode()     do { ANSELBbits.ANSELB3 = 0; } while(0)

// get/set I2CINT aliases
#define I2CINT_TRIS                 TRISBbits.TRISB4
#define I2CINT_LAT                  LATBbits.LATB4
#define I2CINT_PORT                 PORTBbits.RB4
#define I2CINT_WPU                  WPUBbits.WPUB4
#define I2CINT_OD                   ODCONBbits.ODCB4
#define I2CINT_ANS                  ANSELBbits.ANSELB4
#define I2CINT_SetHigh()            do { LATBbits.LATB4 = 1; } while(0)
#define I2CINT_SetLow()             do { LATBbits.LATB4 = 0; } while(0)
#define I2CINT_Toggle()             do { LATBbits.LATB4 = ~LATBbits.LATB4; } while(0)
#define I2CINT_GetValue()           PORTBbits.RB4
#define I2CINT_SetDigitalInput()    do { TRISBbits.TRISB4 = 1; } while(0)
#define I2CINT_SetDigitalOutput()   do { TRISBbits.TRISB4 = 0; } while(0)
#define I2CINT_SetPullup()          do { WPUBbits.WPUB4 = 1; } while(0)
#define I2CINT_ResetPullup()        do { WPUBbits.WPUB4 = 0; } while(0)
#define I2CINT_SetPushPull()        do { ODCONBbits.ODCB4 = 0; } while(0)
#define I2CINT_SetOpenDrain()       do { ODCONBbits.ODCB4 = 1; } while(0)
#define I2CINT_SetAnalogMode()      do { ANSELBbits.ANSELB4 = 1; } while(0)
#define I2CINT_SetDigitalMode()     do { ANSELBbits.ANSELB4 = 0; } while(0)

// get/set SW2 aliases
#define SW2_TRIS                 TRISBbits.TRISB5
#define SW2_LAT                  LATBbits.LATB5
#define SW2_PORT                 PORTBbits.RB5
#define SW2_WPU                  WPUBbits.WPUB5
#define SW2_OD                   ODCONBbits.ODCB5
#define SW2_ANS                  ANSELBbits.ANSELB5
#define SW2_SetHigh()            do { LATBbits.LATB5 = 1; } while(0)
#define SW2_SetLow()             do { LATBbits.LATB5 = 0; } while(0)
#define SW2_Toggle()             do { LATBbits.LATB5 = ~LATBbits.LATB5; } while(0)
#define SW2_GetValue()           PORTBbits.RB5
#define SW2_SetDigitalInput()    do { TRISBbits.TRISB5 = 1; } while(0)
#define SW2_SetDigitalOutput()   do { TRISBbits.TRISB5 = 0; } while(0)
#define SW2_SetPullup()          do { WPUBbits.WPUB5 = 1; } while(0)
#define SW2_ResetPullup()        do { WPUBbits.WPUB5 = 0; } while(0)
#define SW2_SetPushPull()        do { ODCONBbits.ODCB5 = 0; } while(0)
#define SW2_SetOpenDrain()       do { ODCONBbits.ODCB5 = 1; } while(0)
#define SW2_SetAnalogMode()      do { ANSELBbits.ANSELB5 = 1; } while(0)
#define SW2_SetDigitalMode()     do { ANSELBbits.ANSELB5 = 0; } while(0)

// get/set LED1 aliases
#define LED1_TRIS                 TRISCbits.TRISC0
#define LED1_LAT                  LATCbits.LATC0
#define LED1_PORT                 PORTCbits.RC0
#define LED1_WPU                  WPUCbits.WPUC0
#define LED1_OD                   ODCONCbits.ODCC0
#define LED1_ANS                  ANSELCbits.ANSELC0
#define LED1_SetHigh()            do { LATCbits.LATC0 = 1; } while(0)
#define LED1_SetLow()             do { LATCbits.LATC0 = 0; } while(0)
#define LED1_Toggle()             do { LATCbits.LATC0 = ~LATCbits.LATC0; } while(0)
#define LED1_GetValue()           PORTCbits.RC0
#define LED1_SetDigitalInput()    do { TRISCbits.TRISC0 = 1; } while(0)
#define LED1_SetDigitalOutput()   do { TRISCbits.TRISC0 = 0; } while(0)
#define LED1_SetPullup()          do { WPUCbits.WPUC0 = 1; } while(0)
#define LED1_ResetPullup()        do { WPUCbits.WPUC0 = 0; } while(0)
#define LED1_SetPushPull()        do { ODCONCbits.ODCC0 = 0; } while(0)
#define LED1_SetOpenDrain()       do { ODCONCbits.ODCC0 = 1; } while(0)
#define LED1_SetAnalogMode()      do { ANSELCbits.ANSELC0 = 1; } while(0)
#define LED1_SetDigitalMode()     do { ANSELCbits.ANSELC0 = 0; } while(0)

// get/set LED2 aliases
#define LED2_TRIS                 TRISCbits.TRISC1
#define LED2_LAT                  LATCbits.LATC1
#define LED2_PORT                 PORTCbits.RC1
#define LED2_WPU                  WPUCbits.WPUC1
#define LED2_OD                   ODCONCbits.ODCC1
#define LED2_ANS                  ANSELCbits.ANSELC1
#define LED2_SetHigh()            do { LATCbits.LATC1 = 1; } while(0)
#define LED2_SetLow()             do { LATCbits.LATC1 = 0; } while(0)
#define LED2_Toggle()             do { LATCbits.LATC1 = ~LATCbits.LATC1; } while(0)
#define LED2_GetValue()           PORTCbits.RC1
#define LED2_SetDigitalInput()    do { TRISCbits.TRISC1 = 1; } while(0)
#define LED2_SetDigitalOutput()   do { TRISCbits.TRISC1 = 0; } while(0)
#define LED2_SetPullup()          do { WPUCbits.WPUC1 = 1; } while(0)
#define LED2_ResetPullup()        do { WPUCbits.WPUC1 = 0; } while(0)
#define LED2_SetPushPull()        do { ODCONCbits.ODCC1 = 0; } while(0)
#define LED2_SetOpenDrain()       do { ODCONCbits.ODCC1 = 1; } while(0)
#define LED2_SetAnalogMode()      do { ANSELCbits.ANSELC1 = 1; } while(0)
#define LED2_SetDigitalMode()     do { ANSELCbits.ANSELC1 = 0; } while(0)

// get/set LED3 aliases
#define LED3_TRIS                 TRISCbits.TRISC2
#define LED3_LAT                  LATCbits.LATC2
#define LED3_PORT                 PORTCbits.RC2
#define LED3_WPU                  WPUCbits.WPUC2
#define LED3_OD                   ODCONCbits.ODCC2
#define LED3_ANS                  ANSELCbits.ANSELC2
#define LED3_SetHigh()            do { LATCbits.LATC2 = 1; } while(0)
#define LED3_SetLow()             do { LATCbits.LATC2 = 0; } while(0)
#define LED3_Toggle()             do { LATCbits.LATC2 = ~LATCbits.LATC2; } while(0)
#define LED3_GetValue()           PORTCbits.RC2
#define LED3_SetDigitalInput()    do { TRISCbits.TRISC2 = 1; } while(0)
#define LED3_SetDigitalOutput()   do { TRISCbits.TRISC2 = 0; } while(0)
#define LED3_SetPullup()          do { WPUCbits.WPUC2 = 1; } while(0)
#define LED3_ResetPullup()        do { WPUCbits.WPUC2 = 0; } while(0)
#define LED3_SetPushPull()        do { ODCONCbits.ODCC2 = 0; } while(0)
#define LED3_SetOpenDrain()       do { ODCONCbits.ODCC2 = 1; } while(0)
#define LED3_SetAnalogMode()      do { ANSELCbits.ANSELC2 = 1; } while(0)
#define LED3_SetDigitalMode()     do { ANSELCbits.ANSELC2 = 0; } while(0)

// get/set LED4 aliases
#define LED4_TRIS                 TRISCbits.TRISC3
#define LED4_LAT                  LATCbits.LATC3
#define LED4_PORT                 PORTCbits.RC3
#define LED4_WPU                  WPUCbits.WPUC3
#define LED4_OD                   ODCONCbits.ODCC3
#define LED4_ANS                  ANSELCbits.ANSELC3
#define LED4_SetHigh()            do { LATCbits.LATC3 = 1; } while(0)
#define LED4_SetLow()             do { LATCbits.LATC3 = 0; } while(0)
#define LED4_Toggle()             do { LATCbits.LATC3 = ~LATCbits.LATC3; } while(0)
#define LED4_GetValue()           PORTCbits.RC3
#define LED4_SetDigitalInput()    do { TRISCbits.TRISC3 = 1; } while(0)
#define LED4_SetDigitalOutput()   do { TRISCbits.TRISC3 = 0; } while(0)
#define LED4_SetPullup()          do { WPUCbits.WPUC3 = 1; } while(0)
#define LED4_ResetPullup()        do { WPUCbits.WPUC3 = 0; } while(0)
#define LED4_SetPushPull()        do { ODCONCbits.ODCC3 = 0; } while(0)
#define LED4_SetOpenDrain()       do { ODCONCbits.ODCC3 = 1; } while(0)
#define LED4_SetAnalogMode()      do { ANSELCbits.ANSELC3 = 1; } while(0)
#define LED4_SetDigitalMode()     do { ANSELCbits.ANSELC3 = 0; } while(0)

// get/set RC4 procedures
#define RC4_SetHigh()            do { LATCbits.LATC4 = 1; } while(0)
#define RC4_SetLow()             do { LATCbits.LATC4 = 0; } while(0)
#define RC4_Toggle()             do { LATCbits.LATC4 = ~LATCbits.LATC4; } while(0)
#define RC4_GetValue()              PORTCbits.RC4
#define RC4_SetDigitalInput()    do { TRISCbits.TRISC4 = 1; } while(0)
#define RC4_SetDigitalOutput()   do { TRISCbits.TRISC4 = 0; } while(0)
#define RC4_SetPullup()             do { WPUCbits.WPUC4 = 1; } while(0)
#define RC4_ResetPullup()           do { WPUCbits.WPUC4 = 0; } while(0)
#define RC4_SetAnalogMode()         do { ANSELCbits.ANSELC4 = 1; } while(0)
#define RC4_SetDigitalMode()        do { ANSELCbits.ANSELC4 = 0; } while(0)

// get/set RC5 procedures
#define RC5_SetHigh()            do { LATCbits.LATC5 = 1; } while(0)
#define RC5_SetLow()             do { LATCbits.LATC5 = 0; } while(0)
#define RC5_Toggle()             do { LATCbits.LATC5 = ~LATCbits.LATC5; } while(0)
#define RC5_GetValue()              PORTCbits.RC5
#define RC5_SetDigitalInput()    do { TRISCbits.TRISC5 = 1; } while(0)
#define RC5_SetDigitalOutput()   do { TRISCbits.TRISC5 = 0; } while(0)
#define RC5_SetPullup()             do { WPUCbits.WPUC5 = 1; } while(0)
#define RC5_ResetPullup()           do { WPUCbits.WPUC5 = 0; } while(0)
#define RC5_SetAnalogMode()         do { ANSELCbits.ANSELC5 = 1; } while(0)
#define RC5_SetDigitalMode()        do { ANSELCbits.ANSELC5 = 0; } while(0)

// get/set RC6 procedures
#define RC6_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define RC6_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define RC6_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define RC6_GetValue()              PORTCbits.RC6
#define RC6_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define RC6_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define RC6_SetPullup()             do { WPUCbits.WPUC6 = 1; } while(0)
#define RC6_ResetPullup()           do { WPUCbits.WPUC6 = 0; } while(0)
#define RC6_SetAnalogMode()         do { ANSELCbits.ANSELC6 = 1; } while(0)
#define RC6_SetDigitalMode()        do { ANSELCbits.ANSELC6 = 0; } while(0)

// get/set RC7 procedures
#define RC7_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define RC7_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define RC7_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define RC7_GetValue()              PORTCbits.RC7
#define RC7_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define RC7_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define RC7_SetPullup()             do { WPUCbits.WPUC7 = 1; } while(0)
#define RC7_ResetPullup()           do { WPUCbits.WPUC7 = 0; } while(0)
#define RC7_SetAnalogMode()         do { ANSELCbits.ANSELC7 = 1; } while(0)
#define RC7_SetDigitalMode()        do { ANSELCbits.ANSELC7 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/